# a = 5
#
# while a <= 10:
#     print("a = " + str(a))
#     a += 1
#Условие за прекратяване на повторението
# докато "а" е по-малко или равно на 10 принтирай "а" и след всяка итерация добавяй единица към стойността "а"

#---------------------------------------------------------------------------------------------------------------------------------


# line = input
#
# while line != "Stop":
#     print("Loop")
#     line = input()
# Условие за прекратяване на повторението
#докато line(текстът който си написал на конзолата) не е равно на "Stop" принтирай "Loop" и напиши нова стойност на line

